modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="XSPI1">
      <name>XSPI2</name>
      <description>XSPI</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x5200a000</baseAddress>
      <interrupt>
        <name>XSPI2</name>
        <description>XSPI2 global interrupt</description>
        <value>106</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>XSPIM</name>
      <description>XSPI IO Manager</description>
      <groupName>XSPIM</groupName>
      <baseAddress>0x5200b400</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>XSPIM IO Manager Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>Multiplexed Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Multiplexing Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_EN</name>
              <description>Chip select selector override enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_O1</name>
              <description>Chip select selector override setting for XSPI1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_O2</name>
              <description>Chip select selector override setting for XSPI2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REQ2ACK_TIME</name>
              <description>REQ to ACK Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MCE1</name>
      <groupName>MCE</groupName>
      <baseAddress>0x5200b800</baseAddress>
      <interrupt>
        <name>MCE1</name>
        <description>MCE1 global interrupt</description>
        <value>102</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>MCE configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GLOCK</name>
              <description>MCE global lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MKLOCK</name>
              <description>MCE master and fast master keys lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>MCE status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MKVALID</name>
              <description>MCE master key valid flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMKVALID</name>
              <description>MCE fast master key valid flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENCDIS</name>
              <description>MCE encryption disabled flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IASR</name>
          <description>MCE illegal access status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAEF</name>
              <description>MCE configuration access error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IAEF</name>
              <description>MCE illegal access error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IACR</name>
          <description>MCE illegal access clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAEF</name>
              <description>MCE configuration access error clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IAEF</name>
              <description>MCE illegal access error clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IAIER</name>
          <description>MCE illegal access interrupt enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAEIE</name>
              <description>MCE configuration access error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IAEIE</name>
              <description>MCE illegal access error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR</name>
          <description>MCE privileged configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIV</name>
              <description>MCE privileged configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IAESR</name>
          <description>MCE illegal access error status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IAPRIV</name>
              <description>MCE illegal access privilege</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IANRW</name>
              <description>MCE illegal access read/write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IADDR</name>
          <description>MCE illegal address register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IADD</name>
              <description>MCE illegal address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REGCR1</name>
          <description>MCE region configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BREN</name>
              <description>MCE base region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTXID</name>
              <description>MCE context ID</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENC</name>
              <description>MCE encrypted region</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>MCE privileged region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR1</name>
          <description>MCE region start address register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDSTART</name>
              <description>MCE region address start</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EADDR1</name>
          <description>MCE region end address register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDEND</name>
              <description>MCE region address end</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTR1</name>
          <description>MCE region attribute register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>MCE region write enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REGCR2</name>
          <description>MCE region configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BREN</name>
              <description>MCE base region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTXID</name>
              <description>MCE context ID</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENC</name>
              <description>MCE encrypted region</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>MCE privileged region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR2</name>
          <description>MCE region start address register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDSTART</name>
              <description>MCE region address start</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EADDR2</name>
          <description>MCE region end address register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDEND</name>
              <description>MCE region address end</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTR2</name>
          <description>MCE region attribute register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>MCE region write enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REGCR3</name>
          <description>MCE region configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BREN</name>
              <description>MCE base region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTXID</name>
              <description>MCE context ID</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENC</name>
              <description>MCE encrypted region</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>MCE privileged region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR3</name>
          <description>MCE region start address register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDSTART</name>
              <description>MCE region address start</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EADDR3</name>
          <description>MCE region end address register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDEND</name>
              <description>MCE region address end</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTR3</name>
          <description>MCE region attribute register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>MCE region write enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REGCR4</name>
          <description>MCE region configuration register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BREN</name>
              <description>MCE base region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTXID</name>
              <description>MCE context ID</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENC</name>
              <description>MCE encrypted region</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>MCE privileged region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR4</name>
          <description>MCE region start address register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDSTART</name>
              <description>MCE region address start</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EADDR4</name>
          <description>MCE region end address register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BADDEND</name>
              <description>MCE region address end</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTR4</name>
          <description>MCE region attribute register</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>MCE region write enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR0</name>
          <description>MCE master key register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MKEY</name>
              <description>MCE master key, bits [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR1</name>
          <description>MCE master key register 1</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MKEY</name>
              <description>MCE master key, bits [63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR2</name>
          <description>MCE master key register 2</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MKEY</name>
              <description>MCE master key, bits [95:64]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MKEYR3</name>
          <description>MCE master key register 3</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MKEY</name>
              <description>MCE master key, bits [127:96]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR0</name>
          <description>MCE fast master key register 0</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMKEY</name>
              <description>MCE fast master key, bits [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR1</name>
          <description>MCE fast master key register 1</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMKEY</name>
              <description>MCE fast master key, bits [63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR2</name>
          <description>MCE fast master key register 2</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMKEY</name>
              <description>MCE fast master key, bits [95:64]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMKEYR3</name>
          <description>MCE fast master key register 3</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMKEY</name>
              <description>MCE fast master key, bits [127:96]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
