modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
        <register>
          <name>LUT570L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT570H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT571L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT571H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT572L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT572H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT573L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT573H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT574L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT574H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT575L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT575H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x21fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT576L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT576H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT577L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT577H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x220c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT578L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT578H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT579L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT579H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x221c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT580L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT580H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT581L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT581H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x222c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT582L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2230</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT582H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT583L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2238</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT583H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x223c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT584L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT584H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT585L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT585H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x224c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[17:0] bits (Line offset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT586L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x2250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
