modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SBS</name>
      <description>System configuration, boot and security controller</description>
      <groupName>SBS</groupName>
      <baseAddress>0x58000400</baseAddress>
      <registers>
        <register>
          <name>BOOTSR</name>
          <description>SBS Boot Status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INITVTOR</name>
              <description>Initial vector for Cortex-M7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLCR</name>
          <description>SBS Hide Protection Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INCR_HDPL</name>
              <description>Increment HDPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLSR</name>
          <description>SBS Hide Protection Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HDPL</name>
              <description>Hide protection level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HDPL0</name>
                  <description>Hide protection level 0</description>
                  <value>180</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HDPL1</name>
                  <description>Hide protection level 1</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HDPL2</name>
                  <description>Hide protection level 2</description>
                  <value>138</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HDPL3</name>
                  <description>Hide protection level 3</description>
                  <value>111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCR</name>
          <description>SBS Debug Control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AP_UNLOCK</name>
              <description>Access port unlock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_UNLOCK</name>
              <description>Debug unlock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_AUTH_HDPL</name>
              <description>Authenticated debug hide protection level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGLOCKR</name>
          <description>SBS Debug Lock register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGCFG_LOCK</name>
              <description>Debug configuration lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSCMDR</name>
          <description>SBS RSS Command register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSSCMD</name>
              <description>RSS command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCR</name>
          <description>SBS Product Mode &amp; Config register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOSTEN</name>
              <description>Booster enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOSTVDDSEL</name>
              <description>Booster Vdd selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDA</name>
                  <description>Vdda selected as analog switch booster voltage supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>Vdd selected as analog switch booster voltage supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH_PHYSEL</name>
              <description>Ethernet PHY interface selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GMII_MII</name>
                  <description>GMII or MII interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMII</name>
                  <description>RMII interface</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXISRAM_WS</name>
              <description>AXISRAM wait state</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WS</name>
                  <description>No wait state added when accessing AXISRAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_WS</name>
                  <description>One wait state added when accessing AXISRAM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FPUIMR</name>
          <description>SBS FPU Interrupt Mask register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPU_IE</name>
              <description>All FPU interrupts enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MESR</name>
          <description>SBS Memory Erase Status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEF</name>
              <description>Memory erase flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCSR</name>
          <description>SBS IO Compensation Cell Control and Status register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>Compensation cell enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP_CODESEL</name>
              <description>Compensation cell code selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CELL</name>
                  <description>Code applied to compensation cell from cell</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG</name>
                  <description>Code applied to compensation cell from register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI1_COMP_EN</name>
              <description>XSPIM_P1 compensation cell enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1_COMP_CODESEL</name>
              <description>XSPIM_P1 compensation cell code selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CELL</name>
                  <description>Code applied to compensation cell from cell</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG</name>
                  <description>Code applied to compensation cell from register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI2_COMP_EN</name>
              <description>XSPIM_P2 compensation cell enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2_COMP_CODESEL</name>
              <description>XSPIM_P2 compensation cell code selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CELL</name>
                  <description>Code applied to compensation cell from cell</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG</name>
                  <description>Code applied to compensation cell from register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_RDY</name>
              <description>Compensation cell ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1_COMP_RDY</name>
              <description>XSPIM_P1 compensation cell ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2_COMP_RDY</name>
              <description>XSPIM_P2 compensation cell ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IOHSLV</name>
              <description>I/O high speed at low voltage</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1_IOHSLV</name>
              <description>XSPIM_P1 I/O high speed at low voltage</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2_IOHSLV</name>
              <description>XSPIM_P2 I/O high speed at low voltage</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCVALR</name>
          <description>SBS IO Compensation Cell Value register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NSRC</name>
              <description>NMOS transistors slew-rate compensation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PSRC</name>
              <description>PMOS transistors slew-rate compensation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI1_NSRC</name>
              <description>XSPIM_P1 NMOS transistors slew-rate compensation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI1_PSRC</name>
              <description>XSPIM_P1 PMOS transistors slew-rate compensation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI2_NSRC</name>
              <description>XSPIM_P2 NMOS transistors slew-rate compensation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI2_PSRC</name>
              <description>XSPIM_P2 PMOS transistors slew-rate compensation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSWVALR</name>
          <description>SBS IO Compensation Cell Software Value register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW_NSRC</name>
              <description>Software NMOS transistors slew-rate compensation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SW_PSRC</name>
              <description>Software PMOS transistors slew-rate compensation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI1_SW_NSRC</name>
              <description>XSPIM_P1 software NMOS transistors slew-rate compensation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI1_SW_PSRC</name>
              <description>XSPIM_P1 software PMOS transistors slew-rate compensation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI2_SW_NSRC</name>
              <description>XSPIM_P2 software NMOS transistors slew-rate compensation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>XSPI2_SW_PSRC</name>
              <description>XSPIM_P2 software PMOS transistors slew-rate compensation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKLOCKR</name>
          <description>SBS Break Lockup register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVD_BL</name>
              <description>PVD break lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHECC_BL</name>
              <description>Flash ECC error break lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CM7LCKUP_BL</name>
              <description>Cortex-M7 lockup break lock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKRAMECC_BL</name>
              <description>Backup RAM ECC error break lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMECC_BL</name>
              <description>DTCM ECC error break lock</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMECC_BL</name>
              <description>ITCM ECC error break lock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARAM3ECC_BL</name>
              <description>AXIRAM3 ECC error break lock</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARAM1ECC_BL</name>
              <description>AXIRAM1 ECC error break lock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <description>SBS External Interrupt Configuration registers</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC_EXTI0</name>
              <description>Port configuration EXTI 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI1</name>
              <description>Port configuration EXTI 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI2</name>
              <description>Port configuration EXTI 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI3</name>
              <description>Port configuration EXTI 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <description>SBS External Interrupt Configuration registers</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC_EXTI4</name>
              <description>Port configuration EXTI 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI5</name>
              <description>Port configuration EXTI 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI6</name>
              <description>Port configuration EXTI 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI7</name>
              <description>Port configuration EXTI 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <description>SBS External Interrupt Configuration registers</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC_EXTI8</name>
              <description>Port configuration EXTI 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI9</name>
              <description>Port configuration EXTI 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI10</name>
              <description>Port configuration EXTI 10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI11</name>
              <description>Port configuration EXTI 11</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <description>SBS External Interrupt Configuration registers</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC_EXTI12</name>
              <description>Port configuration EXTI 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI13</name>
              <description>Port configuration EXTI 13</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI14</name>
              <description>Port configuration EXTI 14</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PC_EXTI15</name>
              <description>Port configuration EXTI 15</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
