modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
        <register>
          <name>CFGR</name>
          <description>RCC clock configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW</name>
              <description>SW[2:0] bits (System clock switch)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS[2:0] bits (System clock switch status)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 used as system clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPWUCK</name>
              <description>Wake Up from stop and CSS backup clock selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPKERWUCK</name>
              <description>Kernel Clock Selection after a Wake Up from Stop</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <description>RTCPRE[5:0] bits (HSE division factor for RTC clock)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLOCK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_8</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_9</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_10</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_11</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_12</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_13</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_14</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_15</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_16</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_17</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_18</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_19</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_20</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_21</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_22</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_23</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_24</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_25</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_26</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_27</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_28</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_29</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_30</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_31</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_32</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_33</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_34</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_35</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_36</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_37</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_38</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_39</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_40</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_41</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_42</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_43</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_44</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_45</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_46</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_47</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_48</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_49</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_50</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_51</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_52</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_53</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_54</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_55</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_56</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_57</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_58</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_59</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_60</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_61</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_62</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_63</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPRE</name>
              <description>TIMPRE configuration</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCO1PRE</name>
              <description>MCO1 configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1SEL</name>
              <description>MCO1SEL [2:0] bits (MCO1 clock output selection)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <description>MCO2 configuration</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2SEL</name>
              <description>MCO2SEL [2:0] bits (MCO2 clock output selection)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDCFGR</name>
          <description>RCC CPU domain configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPRE</name>
              <description>CPRE[3:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCFGR</name>
          <description>RCC Bus matrix configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BMPRE</name>
              <description>BMPRE[3:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCFGR</name>
          <description>RCC APB clock configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPRE1</name>
              <description>PPRE1[2:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PPRE2[2:0] bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE4</name>
              <description>PPRE4[2:0] bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE5</name>
              <description>PPRE5[2:0] bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
