modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
        <register>
          <name>UCPDR</name>
          <description>PWR USB Type-C and power delivery register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UCPD_DBDIS</name>
              <description>UCPD dead battery disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UCPD_STBY</name>
              <description>UCPD Standby mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APCR</name>
          <description>PWR apply pull configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APC</name>
              <description>Apply pull configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PN7_PUPD</name>
              <description>Port N bit 7 pull-up/down configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PO5_PUPD</name>
              <description>Port O bit 5 pull-up/down configuration</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3CPB6_PU</name>
              <description>Port PB6 I3C pull-up bit configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3CPB7_PU</name>
              <description>Port PB7 I3C pull-up bit configuration</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3CPB8_PU</name>
              <description>Port PB8 I3C pull-up bit configuration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I3CPB9_PU</name>
              <description>Port PB9 I3C pull-up bit configuration</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRN</name>
          <description>PWR port N pull-up control register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PUN1</name>
              <description>PUN1: Port N pull-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUN6</name>
              <description>PUN6: Port N pull-up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUN12</name>
              <description>PUN12: Port N pull-up</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRN</name>
          <description>PWR port N pull-down control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDN0</name>
              <description>PDN0: Port N pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDN1</name>
              <description>PDN1: Port N pull-down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDN2N5</name>
              <description>PDN2 to PDN5: Port N pull-down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDN6</name>
              <description>PDN6: Port N pull-down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDN8N11</name>
              <description>PDN8 to PDN11: Port N pull-down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDN12</name>
              <description>PDN12: Port N pull-down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRO</name>
          <description>PWR port O pull-up control register</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PUO0</name>
              <description>PUO0: Port O pull-up</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUO1</name>
              <description>PUO1: Port O pull-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUO4</name>
              <description>PUO4: Port O pull-up</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRO</name>
          <description>PWR port O pull-down control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDO0</name>
              <description>PDO0: Port O pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDO1</name>
              <description>PDO1: Port O pull-down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDO2</name>
              <description>PDO2: Port O pull-down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDO3</name>
              <description>PDO3: Port O pull-down</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDO4</name>
              <description>PDO4: Port O pull-down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRP</name>
          <description>PWR port P pull-down control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDP0P3</name>
              <description>PPO0 to PP03 : Port P pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDP4P7</name>
              <description>PPO4 to PP07 : Port P pull-down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDP8P11</name>
              <description>PPO8 to PP11 : Port P pull-down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDP12P15</name>
              <description>PP12 to PP15 : Port P pull-down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDR1</name>
          <description>PWR debug register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
