modm-ext/data.modm.io/docs/svd/header_stm32h7s3xx.svd
        <register>
          <name>CIDR0</name>
          <description>Debug MCU component identity register 0</description>
          <addressOffset>0xff0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Component ID field, bits [7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR1</name>
          <description>Debug MCU component identity register 1</description>
          <addressOffset>0xff4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Component ID field, bits [11:8]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLASS</name>
              <description>Component ID field, bits [15:12] - component class</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR2</name>
          <description>Debug MCU component identity register 2</description>
          <addressOffset>0xff8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Component ID field, bits [23:16]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR3</name>
          <description>Debug MCU component identity register 3</description>
          <addressOffset>0xffc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Component ID field, bits [31:24]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXIM_AMIB_1</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff02000</baseAddress>
      <registers>
        <register>
          <name>FNMODBMISS</name>
          <description>AXIM AMIB fn_mod_bm_iss register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ_ISS</name>
              <description>Force read issuing capability to 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS</name>
              <description>Force write issuing capability to 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FNMOD2</name>
          <description>AXIM AMIB fn_mod2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>Bypass Merge enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FNMODLB</name>
          <description>AXIM AMIB fn_mod_lb register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LONG_BURST</name>
              <description>Long bursts can be generated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FNMOD</name>
          <description>AXIM AMIB fn_mod register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ_ISS</name>
              <description>Force read issuing capability to 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS</name>
              <description>Force write issuing capability to 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_2</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff03000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_3</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff04000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_4</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff05000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_5</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff06000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_6</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff07000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_7</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff08000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_8</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff09000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_9</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff0a000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_AMIB_1">
      <name>AXIM_AMIB_10</name>
      <groupName>AXIM_AMIB</groupName>
      <baseAddress>0xbff0b000</baseAddress>
    </peripheral>
    <peripheral>
      <name>AXIM_ASIB_1</name>
      <description>AXIM ASIB</description>
      <groupName>AXIM_ASIB</groupName>
      <baseAddress>0xbff42000</baseAddress>
      <registers>
        <register>
          <name>FNMOD2</name>
          <description>AXIM ASIB fn_mod2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>Bypass Merge enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READQOS</name>
          <description>AXIM ASIB read_qos register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITEQOS</name>
          <description>AXIM ASIB write_qos register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FNMOD</name>
          <description>AXIM ASIB fn_mod register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ_ISS</name>
              <description>Force read issuing capability to 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS</name>
              <description>Force write issuing capability to 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
